from pathlib import Path
import csv
import pandas as pd


class JFE_Table(list[dict[str, str]]):
    """CSVファイルを読み込んで、それをkeyと任意のkeyとvalueの組合せから行を取得出来るようにする
    """
    filename: str

    def __init__(self, filename: str) -> None:
        """
        filename
            `"2. 荷重および応力の組合せ/2-1. 建築用材料の単位容積質量.csv"`
            `"2. 荷重および応力の組合せ/2-2. 固定荷重（令84条）.csv"`
            `"2. 荷重および応力の組合せ/2-3. 積載荷重.csv"`
            `"2. 荷重および応力の組合せ/2-4. 積雪荷重.csv"`
            `"2. 荷重および応力の組合せ/2-5. 基準風速.csv"`
            `"5. 断面性能表/5-1. H形鋼.csv"`
            `"5. 断面性能表/5-3. CT形鋼.csv"`
            `"5. 断面性能表/5-4. 溶接軽量H形鋼.csv"`
            `"5. 断面性能表/5-5.1. 等辺山形鋼.csv"`
            `"5. 断面性能表/5-5.2. 不等辺山形鋼.csv"`
            `"5. 断面性能表/5-5.3. 不等辺不等厚山形鋼.csv"`
            `"5. 断面性能表/5-5.4. 溝形鋼.csv"`
            `"5. 断面性能表/5-5.5. I形鋼.csv"`
            `"5. 断面性能表/5-6. 角型鋼管（小径）.csv"`
            `"5. 断面性能表/5-7. 角形鋼管.csv"`
            `"5. 断面性能表/5-10. 円形鋼管.csv"`
            `"5. 断面性能表/5-12.1. 平鋼.csv"`
            `"5. 断面性能表/5-12.2. 鋼板の単位質量表.csv"`
            `"6. 高力ボルト接合部/6-1.1. 高力ボルトの許容耐力等.csv"`
            `"6. 高力ボルト接合部/6-1.2. ボルトの許容耐力.csv"`
            `"6. 高力ボルト接合部/6-2.1. 形鋼のゲージ.csv"`
            `"6. 高力ボルト接合部/6-2.2. 高力ボルトの孔径・最小縁端距離・ピッチ.csv"`
            `"6. 高力ボルト接合部/6-2.3. 千鳥打ちのゲージとピッチ.csv"`
            `"6. 高力ボルト接合部/6-2.4. 形鋼に対する千鳥打ち.csv"`
            `"6. 高力ボルト接合部/6-6. H梁継手性能表.csv"`
            `"6. 高力ボルト接合部/6-8.1. 丸鋼接合表（ＪＩＳターンバックル筋かい）.csv"`
            `"6. 高力ボルト接合部/6-8.2. 筋かい接合表.csv"`
            `"7. 基礎構造/7-1. 地盤調査によらない場合の許容応力度（令93条）.csv"`
            `"7. 基礎構造/7-5. 鋼管ぐいの断面性能表（一例）.csv"`
            `"8. 各部構造/8-1.2. 異形棒鋼.csv"`
            `"8. 各部構造/8-2.1. JFデッキ・JFウェイブデッキ.csv"`
            `"8. 各部構造/8-2.2. JF75ME・JF75MW・JF100M.csv"`
            `"8. 各部構造/8-2.3. JF75・JF75W・JF75α・JF100.csv"`
            `"8. 各部構造/8-3.1. QLデッキ.csv"`
            `"8. 各部構造/8-3.2. 合成スラブ断面性能表.csv"`
            `"8. 各部構造/8-3.3. ひび割れ防止筋等の重量.csv"`
            `"8. 各部構造/8-3.4. QLデッキ許容積載荷重表.csv"`
            `"8. 各部構造/8-5. 母屋・根太.csv"`
            `"8. 各部構造/8-8.1. 露出柱脚アンカーボルト.csv"`
        """
        self.filename = filename
        with open(Path(__file__).parent.joinpath(self.filename), "r", encoding="utf_8_sig") as fp:
            super().__init__(csv.DictReader(fp))

    def headers(self) -> list[str]:
        """表のヘッダ一覧を返す"""
        return self[0].keys()

    def keys(self) -> list[str]:
        return [d["key"] for d in self]

    def get_by_key(self, key: str) -> dict[str, str]:
        """keyで一致する行を返す"""
        return self.get_by_value("key", key)[0]

    def get_by_value(self, **kwargs) -> list[dict[str, str]]:
        return [d for d in filter(lambda d: all([d[header] == str(value) for header, value in kwargs.items()]), self)]


class JFE_Pandas(pd.DataFrame):
    """CSVファイルを読み込んで、それをkeyと任意のkeyとvalueの組合せから行を取得出来るようにする
    """
    filename: str

    def __init__(self, filename: str) -> "JFE_Pandas":
        """
        filename
            `"2. 荷重および応力の組合せ/2-1. 建築用材料の単位容積質量.csv"`
            `"2. 荷重および応力の組合せ/2-2. 固定荷重（令84条）.csv"`
            `"2. 荷重および応力の組合せ/2-3. 積載荷重.csv"`
            `"2. 荷重および応力の組合せ/2-4. 積雪荷重.csv"`
            `"2. 荷重および応力の組合せ/2-5. 基準風速.csv"`
            `"5. 断面性能表/5-1. H形鋼.csv"`
            `"5. 断面性能表/5-3. CT形鋼.csv"`
            `"5. 断面性能表/5-4. 溶接軽量H形鋼.csv"`
            `"5. 断面性能表/5-5.1. 等辺山形鋼.csv"`
            `"5. 断面性能表/5-5.2. 不等辺山形鋼.csv"`
            `"5. 断面性能表/5-5.3. 不等辺不等厚山形鋼.csv"`
            `"5. 断面性能表/5-5.4. 溝形鋼.csv"`
            `"5. 断面性能表/5-5.5. I形鋼.csv"`
            `"5. 断面性能表/5-6. 角型鋼管（小径）.csv"`
            `"5. 断面性能表/5-7. 角形鋼管.csv"`
            `"5. 断面性能表/5-10. 円形鋼管.csv"`
            `"5. 断面性能表/5-12.1. 平鋼.csv"`
            `"5. 断面性能表/5-12.2. 鋼板の単位質量表.csv"`
            `"6. 高力ボルト接合部/6-1.1. 高力ボルトの許容耐力等.csv"`
            `"6. 高力ボルト接合部/6-1.2. ボルトの許容耐力.csv"`
            `"6. 高力ボルト接合部/6-2.1. 形鋼のゲージ.csv"`
            `"6. 高力ボルト接合部/6-2.2. 高力ボルトの孔径・最小縁端距離・ピッチ.csv"`
            `"6. 高力ボルト接合部/6-2.3. 千鳥打ちのゲージとピッチ.csv"`
            `"6. 高力ボルト接合部/6-2.4. 形鋼に対する千鳥打ち.csv"`
            `"6. 高力ボルト接合部/6-6. H梁継手性能表.csv"`
            `"6. 高力ボルト接合部/6-8.1. 丸鋼接合表（ＪＩＳターンバックル筋かい）.csv"`
            `"6. 高力ボルト接合部/6-8.2. 筋かい接合表.csv"`
            `"7. 基礎構造/7-1. 地盤調査によらない場合の許容応力度（令93条）.csv"`
            `"7. 基礎構造/7-5. 鋼管ぐいの断面性能表（一例）.csv"`
            `"8. 各部構造/8-1.2. 異形棒鋼.csv"`
            `"8. 各部構造/8-2.1. JFデッキ・JFウェイブデッキ.csv"`
            `"8. 各部構造/8-2.2. JF75ME・JF75MW・JF100M.csv"`
            `"8. 各部構造/8-2.3. JF75・JF75W・JF75α・JF100.csv"`
            `"8. 各部構造/8-3.1. QLデッキ.csv"`
            `"8. 各部構造/8-3.2. 合成スラブ断面性能表.csv"`
            `"8. 各部構造/8-3.3. ひび割れ防止筋等の重量.csv"`
            `"8. 各部構造/8-3.4. QLデッキ許容積載荷重表.csv"`
            `"8. 各部構造/8-5. 母屋・根太.csv"`
            `"8. 各部構造/8-8.1. 露出柱脚アンカーボルト.csv"`
        """
        ret: pd.DataFrame = pd.read_csv(
            Path(__file__).parent.joinpath(filename),
            encoding="utf_8_sig",
        )
        ret.index = ret.key
        super().__init__(ret)
